TuonyLiu/nxp/SDK_2.4.1_EasyARM-RT1052-V1_0/boards/EasyARM-RT1052-V1_0/demo_apps/sd_jpeg_ili9806e/pin_mux.c
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_12_LCD_DATA08,    /* GPIO_B0_12 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_13_LCD_DATA09,    /* GPIO_B0_13 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_14_LCD_DATA10,    /* GPIO_B0_14 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_15_LCD_DATA11,    /* GPIO_B0_15 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_00_LCD_DATA12,    /* GPIO_B1_00 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_01_LCD_DATA13,    /* GPIO_B1_01 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_02_LCD_DATA14,    /* GPIO_B1_02 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_03_LCD_DATA15,    /* GPIO_B1_03 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_14_GPIO2_IO30,    /* GPIO_B1_15 PAD functional properties : */
                        0x10B0u);                        /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Keeper
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                            Hyst. Enable Field: Hysteresis Disabled */
  /* SD Card Pin Init */                                                          
#if 0 /* ErasyARM-RT1052 board don't support power en */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_05_GPIO1_IO05,        /* GPIO_AD_B0_05 is configured as GPIO1_IO05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_12_LPUART1_TX,        /* GPIO_AD_B0_12 is configured as LPUART1_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_13_LPUART1_RX,        /* GPIO_AD_B0_13 is configured as LPUART1_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(     /* ErasyARM-RT1052 Card CD pin */
      IOMUXC_GPIO_AD_B1_02_GPIO1_IO18,           /* GPIO_B1_12 is configured as GPIO2_IO28 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#if 0  /* ErasyARM-RT1052 board don't support VSELECT */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_14_USDHC1_VSELECT,       /* GPIO_B1_14 is configured as USDHC1_VSELECT */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B0_00_USDHC1_CMD,        /* GPIO_SD_B0_00 is configured as USDHC1_CMD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B0_01_USDHC1_CLK,        /* GPIO_SD_B0_01 is configured as USDHC1_CLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B0_02_USDHC1_DATA0,      /* GPIO_SD_B0_02 is configured as USDHC1_DATA0 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B0_03_USDHC1_DATA1,      /* GPIO_SD_B0_03 is configured as USDHC1_DATA1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B0_04_USDHC1_DATA2,      /* GPIO_SD_B0_04 is configured as USDHC1_DATA2 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B0_05_USDHC1_DATA3,      /* GPIO_SD_B0_05 is configured as USDHC1_DATA3 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#if 0
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B0_05_GPIO1_IO05,        /* GPIO_AD_B0_05 PAD functional properties : */
      0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
#endif
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B0_12_LPUART1_TX,        /* GPIO_AD_B0_12 PAD functional properties : */
      0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B0_13_LPUART1_RX,        /* GPIO_AD_B0_13 PAD functional properties : */
      0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_02_GPIO1_IO18,           /* GPIO_B1_12 PAD functional properties : */
      0x017089u);                             /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Pull
                                                 Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled */
#if 0 
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_14_USDHC1_VSELECT,       /* GPIO_B1_14 PAD functional properties : */
      0x0170A1u);                             /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/4
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Pull
                                                 Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled */
#endif
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B0_00_USDHC1_CMD,        /* GPIO_SD_B0_00 PAD functional properties : */
      0x017089u);                             /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Pull
                                                 Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B0_01_USDHC1_CLK,        /* GPIO_SD_B0_01 PAD functional properties : */
      0x014089u);                             /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Disabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B0_02_USDHC1_DATA0,      /* GPIO_SD_B0_02 PAD functional properties : */
      0x017089u);                             /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Pull
                                                 Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B0_03_USDHC1_DATA1,      /* GPIO_SD_B0_03 PAD functional properties : */
